{
    "projects": [
        {
            "name": "wizzy.js",
            "subtitle": "A web page editor for web applications",
            "description": "A web page editor that aims to shave off most of the time spent on building user interfaces for web applications. It is a WYSIWYG editor that lets you drag and drop components onto a frame and then export the code to be used in your web application. It is built using JavaScript, HTML and CSS and works with any web framework.",
            "icons": [
                {
                    "devicon": "javascript",
                    "label": "JavaScript"
                }
            ],
            "link": "https://github.com/mkgiga/wizzy"
        },
        {
            "name": "img2pdf",
            "subtitle": "Image to PDF Converter using AI",
            "description": "A python application to convert scanned images to PDF format using EasyOCR, reportlab and PyPDF2. I created this application when I was working for a company that needed to archive paper documents spanning all the way to 1992 so that we could extract key information from them and store them in a database for use in a web application.",
            "icons": [
                {
                    "devicon": "python",
                    "label": "Python"
                }
            ],
            "link": "https://github.com/mkgiga/img2pdf"
        },
        {
            "name": "Awesome Chess",
            "subtitle": "Multiplayer chess, but with guns and explosions?",
            "description": "A real-time multiplayer game of chess added absurd rules. Players move at the same time and turns are on a short time limit. It is built using Node.js and Socket.io. It features a lobby system where players can share a link to invite anyone to play with them. It also has a chat system where players and spectators can communicate with each other. <br><br>Actually, can you even call this chess anymore?",
            "icons": [
                {
                    "devicon": "nodejs",
                    "label": "Node.js"
                },
                {
                    "devicon": "socketio",
                    "label": "Socket.io"
                }
            ],
            "link": "https://github.com/mkgiga/awesome-chess"
        },
        {
            "name": "webtagger",
            "subtitle": "A browser extension for building image classification datasets",
            "description": "A browser extension for building and curating image datasets directly in the web browser. It utilizes the new Side Panel API to provide a seamless experience. It is compatible with the most popular Stable Diffusion LoRA trainer script format, letting you save your dataset as a zip file of images and text file pairs.",
            "icons": [
                {
                    "devicon": "javascript",
                    "label": "JavaScript"
                },
                {
                    "devicon": "html5",
                    "label": "HTML5"
                },
                {
                    "devicon": "css3",
                    "label": "CSS3"
                }
            ],
            "link": "https://github.com/mkgiga/webtagger"
        }
    ]
}